MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/instance/dmac.h
/*
 * Instance header file for WBZ451H
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-10-17T09:05:02Z */
#ifndef _BZ45_DMAC_INSTANCE_
#define _BZ45_DMAC_INSTANCE_


/* ========== Instance Parameter definitions for DMAC peripheral ========== */
#define DMAC_BURST                               (1)        
#define DMAC_CHANNEL0_INT_SRC                    (6)        /* DMA Channel 0 Interrupt */
#define DMAC_CHANNEL10_INT_SRC                   (7)        /* DMA Channel 10 Interrupt */
#define DMAC_CHANNEL11_INT_SRC                   (7)        /* DMA Channel 11 Interrupt */
#define DMAC_CHANNEL12_INT_SRC                   (7)        /* DMA Channel 12 Interrupt */
#define DMAC_CHANNEL13_INT_SRC                   (7)        /* DMA Channel 13 Interrupt */
#define DMAC_CHANNEL14_INT_SRC                   (7)        /* DMA Channel 14 Interrupt */
#define DMAC_CHANNEL15_INT_SRC                   (7)        /* DMA Channel 15 Interrupt */
#define DMAC_CHANNEL1_INT_SRC                    (6)        /* DMA Channel 1 Interrupt */
#define DMAC_CHANNEL2_INT_SRC                    (6)        /* DMA Channel 2 Interrupt */
#define DMAC_CHANNEL3_INT_SRC                    (6)        /* DMA Channel 3 Interrupt */
#define DMAC_CHANNEL4_INT_SRC                    (7)        /* DMA Channel 4 Interrupt */
#define DMAC_CHANNEL5_INT_SRC                    (7)        /* DMA Channel 5 Interrupt */
#define DMAC_CHANNEL6_INT_SRC                    (7)        /* DMA Channel 6 Interrupt */
#define DMAC_CHANNEL7_INT_SRC                    (7)        /* DMA Channel 7 Interrupt */
#define DMAC_CHANNEL8_INT_SRC                    (7)        /* DMA Channel 8 Interrupt */
#define DMAC_CHANNEL9_INT_SRC                    (7)        /* DMA Channel 9 Interrupt */
#define DMAC_CH_BITS                             (5)        
#define DMAC_CH_NUM                              (16)       
#define DMAC_EVIN_NUM                            (8)        
#define DMAC_EVOUT_NUM                           (4)        
#define DMAC_FIFO_SIZE                           (16)       
#define DMAC_INSTANCE_ID                         (34)       
#define DMAC_LVL_BITS                            (2)        
#define DMAC_LVL_NUM                             (4)        
#define DMAC_QOSCTRL_D_RESETVALUE                (2)        
#define DMAC_QOSCTRL_F_RESETVALUE                (2)        
#define DMAC_QOSCTRL_WRB_RESETVALUE              (2)        
#define DMAC_TRIG_BITS                           (7)        
#define DMAC_TRIG_NUM                            (85)       

#endif /* _BZ45_DMAC_INSTANCE_ */
